Revit 2027 API
RebarShapeParameters Methods
The RebarShapeParameters type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAllRebarShapeParameters |  List all shape parameters used by all the existing RebarShapes in the specified document.
GetElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, return InvalidElementId.
GetExternalDefinitionForElementId |  Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOrCreateElementIdForExternalDefinition |  Retrieve the ElementId corresponding to an external rebar shape parameter in the document, if it exists; otherwise, add the parameter to the document and generate a new ElementId.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidExternalDefinition |  Checks that an ExternalDefinition (shared parameter) may be used as a Rebar Shape parameter.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace